Cronograma/calendary/emacs.org
#+Title: Progress Jun 9
#+Author: Pedro G. Branquinho

* DONE Start using diary 2021-06-09 17:38  
  CLOSED: [2021-06-09 Wed 17:45]
  :LOGBOOK:
  - State "DONE"       from "NEXT"       [2021-06-09 Wed 17:45]
  :END:

  - From June 9, to July 21, there are 43 days.
  - From June 9, to July 14, there are 36 days.

** Objective
   Have the presentation and Final Thesis (TCC) written until July 14.

*** What has been done
    It have been done extensive research on software programs which
    can be applied to Industry or/and Academic research and teaching.

**** Results (what literature has been tacked:
     - Linux: O.S. and Window Managers.
     - Emacs: a production environment.
     - Org-mode: reproducible research.
     - LaTeX: powerful typographical system.
     - Clojure, Julia, Python: modeling and simulation.
     - Pinelines (CI/CD): application to agile report production.
 
*** What needs to be done
    1. Gantt Chart demonstrating the plained calendar schedule.
    2. Order the notes and gathered information into usable components
       in the Thesis.
       - Industry: real case use of pipelines and agile report (Demostration).
       - Academic: org-mode literate-programming capabilities
         (Demostrations).
       - Personal: Linux, EXWM, Open Source community, benefits on my formation.
    3. Decide on Beamer or Org-presentations (to be discussed). 
