Schedule/calendary/emacs.tex
% Created 2021-06-09 Wed 18:14
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Pedro G. Branquinho}
\date{\today}
\title{Progress Jun 9}
\hypersetup{
 pdfauthor={Pedro G. Branquinho},
 pdftitle={Progress Jun 9},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{{\bfseries\sffamily DONE} Start using diary 2021-06-09 17:38}
\label{sec:org8e48ef6}
\begin{itemize}
\item From June 9, to July 21, there are 43 days.
\item From June 9, to July 14, there are 36 days.
\end{itemize}

\subsection{Objective}
\label{sec:org8315f04}
Have the presentation and Final Thesis (TCC) written until July 14.

\subsubsection{What has been done}
\label{sec:org2d57880}
It have been done extensive research on software programs which
can be applied to Industry or/and Academic research and teaching.

\begin{enumerate}
\item Results (what literature has been tacked:
\label{sec:org463df83}
\begin{itemize}
\item Linux: O.S. and Window Managers.
\item Emacs: a production environment.
\item Org-mode: reproducible research.
\item \LaTeX{}: powerful typographical system.
\item Clojure, Julia, Python: modeling and simulation.
\item Pinelines (CI/CD): application to agile report production.
\end{itemize}
\end{enumerate}

\subsubsection{What needs to be done}
\label{sec:orgc0627db}
\begin{enumerate}
\item Gantt Chart demonstrating the plained calendar schedule.
\item Order the notes and gathered information into usable components
in the Thesis.
\begin{itemize}
\item Industry: real case use of pipelines and agile report (Demostration).
\item Academic: org-mode literate-programming capabilities
(Demostrations).
\item Personal: Linux, EXWM, Open Source community, benefits on my formation.
\end{itemize}
\item Decide on Beamer or Org-presentations (to be discussed).
\end{enumerate}
\end{document}